# Reset Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCAggregateIterator..::..Reset Method
IFCAggregateIterator Class See Also
---
Resets the iterator to the beginning of the aggregate.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public virtual void Reset()
```

Visual Basic
---
```text
Public Overridable Sub Reset
```

Visual C++
---
```text
public:
virtual void Reset()
```

# See Also
IFCAggregateIterator Class
Autodesk.Revit.DB.IFC Namespace